English/NewWords/note01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2013-05-29 三 23:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-comments"><a href="../../index.html#english">主页</a></div>
</div>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. competent</a></li>
<li><a href="#sec-2">2. topple</a></li>
<li><a href="#sec-3">3. intervene</a></li>
<li><a href="#sec-4">4. interpret</a></li>
<li><a href="#sec-5">5. cope</a></li>
<li><a href="#sec-6">6. irritate</a></li>
<li><a href="#sec-7">7. distort</a></li>
<li><a href="#sec-8">8. hamper</a></li>
<li><a href="#sec-9">9. insulate</a></li>
<li><a href="#sec-10">10. under the impression</a></li>
<li><a href="#sec-11">11. be akin to</a></li>
<li><a href="#sec-12">12. colossal</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> competent</h2>
<div class="outline-text-2" id="text-1">
<p>
Someone who is competent is effective and efficient.<br/>
Examples:<br/>
1 He was a loyal, distinguished and very competent civil servant.<br/>
2 The government performed competently in the face of multiple challenges.<br/>
Extension:<br/>
incompetent: not having the ability to do a job properly.<br/>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> topple</h2>
<div class="outline-text-2" id="text-2">
<p>
If someone or something topples somewhere or if you topple them, they become unsteady or unstable and fall over.<br/>
topple over = topple  ===&gt;  The three is so badly damaged they are worried it might toppled over.<br/>
                      ===&gt;  We lost our balance and topple over on to a table.<br/>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> intervene</h2>
<div class="outline-text-2" id="text-3">
<p>
If you intervene in a situation, you become involoved in it and try to change it.<br/>
Examples:<br/>
1 I'm powerless to intervene in the matter.<br/>
2 I intervened on her behalf to try to get the decision changed.<br/>
intervention(n)<br/>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> interpret</h2>
<div class="outline-text-2" id="text-4">
<p>
If you interpret something in a particular way, you decide that this is its meaning or significance.<br/>
Examples:<br/>
In ancient times people who were thought to have the ability to interpret dreams were likely to be highly respected.<br/>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> cope</h2>
<div class="outline-text-2" id="text-5">
<p>
If you cope with a problem or task, you deal with it successfully.<br/>
Examples:<br/>
1 It was amazing how my mother coped with bring up three children on less than three pounds a week.<br/>
2 The problem were an annoyance, but we managed to cope.<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> irritate</h2>
<div class="outline-text-2" id="text-6">
<p>
If something irritate you, it keeps annoying you.<br/>
</p>
<ol class="org-ol">
<li>Their attitued irritated me.<br/>
</li>
<li>Please do not be irritated by his bad manners since he is merely trying to attract attention.<br/>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> distort</h2>
<div class="outline-text-2" id="text-7">
<p>
If you distort a statement, fact or idea, you report or represent it in an untrue way.<br/>
distorted ==&gt; These figures give a distorted view of the significance for the local economy.<br/>
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> hamper</h2>
<div class="outline-text-2" id="text-8">
<p>
If someone or something hampers you, they make it difficult for you to do what you are trying to do.<br/>
Examples:<br/>
1 The bad weather hampered the rescue operations.<br/>
2 The local business wasn't much hampered by the sudden outbreak of the epidemic<br/>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> insulate</h2>
<div class="outline-text-2" id="text-9">
<p>
1 If a person or group is insulated from the rest of society or from outside influences, they are protected from them.<br/>
2 If a piece of equipment is insulated, it's covered with rubber or plastic to precent electricity passing through it and giving the person using it an electric shock.<br/>
Examples:<br/>
1 The wealthy families had further insulated them from reality with the privilige that money could buy.<br/>
2 In order to make it safe, the element is electrically insulated.<br/>
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> under the impression</h2>
<div class="outline-text-2" id="text-10">
<p>
I was under the impression that Khan Academy is for people new to the subject?<br/>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> be akin to</h2>
<div class="outline-text-2" id="text-11">
<p>
be likely to<br/>
EXAMPLES:<br/>
I'm very happy to see the process is slow and well thought out and isn't rushed. The process is akin to moving a sky-scraper.这个过程就好像建座摩天大楼一样<br/>
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> colossal</h2>
<div class="outline-text-2" id="text-12">
<p>
huge<br/>
EXAMPLE:<br/>
but the effort [required to move and evolve it] is colossal.<br/>
</p>


<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>
</body>
</html>
